xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_rtc.c
/******************************************************************************
 * @file     nano1xx_rtc.c
 * @brief    NANO1xx RTC driver source file.
 *           Real Time Clock (RTC) unit provides user the real time and calendar
 *           message. The RTC uses a 32.768 KHz external crystal. A built in RTC
 *           is designed to generate the periodic interrupt signal. The period 
 *           can be 0.25/ 0.5/ 1/ 2/ 4/ 8 second. There is RTC overflow counter
 *           and it can be adjusted by software.
 * @version  1.0.1
 * @date     04, September, 2012
 *
 * @note
 * Copyright (C) 2012-2014 Nuvoton Technology Corp. All rights reserved.
 ******************************************************************************/
/*---------------------------------------------------------------------------------------------------------*/
/* Includes of local headers                                                                               */
/*---------------------------------------------------------------------------------------------------------*/
#include <stdio.h>
#include "nano1xx.h"
#include "nano1xx_rtc.h"
#include "nano1xx_assert.h"


/** @addtogroup NANO1xx_Device_Driver NANO1xx Device Driver
  @{
*/

/** @addtogroup NANO1xx_RTC_Driver RTC Driver
  @{
*/

/// @cond
/*---------------------------------------------------------------------------------------------------------*/
/* Macro, type and constant definitions                                                                    */
/*---------------------------------------------------------------------------------------------------------*/
#define RTC_GLOBALS

//#define RTC_DEBUG
#ifdef RTC_DEBUG
#define RTCDEBUG     printf
#else
#define RTCDEBUG(...)
#endif

/*---------------------------------------------------------------------------------------------------------*/
/* Global file scope (static) variables                                                                    */
/*---------------------------------------------------------------------------------------------------------*/                  
static char g_chHourMode = 0;

static volatile uint32_t g_u32Reg, g_u32Reg1,g_u32hiYear,g_u32loYear,g_u32hiMonth,g_u32loMonth,g_u32hiDay,g_u32loDay;
static volatile uint32_t g_u32hiHour,g_u32loHour,g_u32hiMin,g_u32loMin,g_u32hiSec,g_u32loSec;

/// @endcond

/** @addtogroup NANO1xx_RTC_EXPORTED_FUNCTIONS RTC Exported Functions
  @{
*/

/**
 *  @brief Set Frequency Compensation Data
 *
 *  @param[in] i32FrequencyX100      Specify the RTC clock X100, ex: 3277365 means 32773.65.
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return    
 *            E_SUCCESS: Success
 *            E_DRVRTC_ERR_FCR_VALUE: Wrong Compensation value
 *
 *  @par Example
 *  @code  
 *  //If the measured RTC crystal frequency is 32773.65Hz.
 *  RTC_SetFrequencyCompensation(3277365);
 *  @endcode
 *
 */
int32_t RTC_SetFrequencyCompensation(int32_t i32FrequencyX100)
{
    int32_t i32RegInt,i32RegFra ;

	/* Compute Interger and Fraction for RTC register*/
    i32RegInt = (i32FrequencyX100/100) - DRVRTC_FCR_REFERENCE;
    i32RegFra = (((i32FrequencyX100%100)) * 60) / 100;
    
	/* Judge Interger part is reasonable */
    if ( (i32RegInt < 0) | (i32RegInt > 15) )
    {
        return E_DRVRTC_ERR_FCR_VALUE ;
    }
	
	RTC_WriteEnable();

	RTC->FCR = (uint32_t)((i32RegInt<<8) | i32RegFra);

    return E_SUCCESS;
}

/**
 *  @brief Access Password to AER to make access other register enable
 *
 *  @param     None
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return               
 *            E_SUCCESS: Success
 *            E_DRVRTC_ERR_FAILED : Failed.
 *
 *  @note After write a password to AER register, TLR / CLR /DWR / TAR /CAR register can be written.
 *
 *  @par Example
 *  @code   
 *  // Before you want to set the value in TLR / CLR /DWR / TAR /CAR register, using the function to open access account.
 *  RTC_WriteEnable (void) ;
 *  @endcode
 *
 */
int32_t RTC_WriteEnable (void)
{
    int32_t i32i = 0;

	int i32retry = 100;
    
	/*-------------------------------------------------------------------------------------------------*/
    /* After 200ms, Access enable wiil auto-clear. As soon as possible to do your setting              */
    /*-------------------------------------------------------------------------------------------------*/
	RETRY:

	i32i = 0;
	
	RTC->AER = DRVRTC_WRITE_KEY;
	
    for (i32i = 0 ; i32i < DRVRTC_WAIT_COUNT ; i32i++)
	{
        /*-------------------------------------------------------------------------------------------------*/
        /* check RTC_AER[16] to find out RTC write enable                                                  */
        /*-------------------------------------------------------------------------------------------------*/
		RTC->AER = DRVRTC_WRITE_KEY;
		
		if (RTC->AER & RTC_AER_ENF)
		    break;
	}

	if (i32i == DRVRTC_WAIT_COUNT)
    {
        RTCDEBUG ("\nRTC: DrvRTC_WriteEnable, set write enable FAILED!\n");

		i32retry--;

        if(!i32retry)
	   		return E_DRVRTC_ERR_FAILED;
						
		goto RETRY;
    }

	return E_SUCCESS;
}

/**
 *  @brief Initial RTC. It consists of enable 32K clock and RTC clock and write initial key to let RTC start count.
 *
 *  @param     None
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return                          
 *            E_SUCCESS: Success
 *            E_DRVRTC_ERR_EIO: Initial RTC Failed.
 *
 *  @par Example
 *  @code   
 *  //In the beginning, call the function to initial RTC
 *  RTC_Init(void) 
 *  @endcode
 *
 */
int32_t RTC_Init (void)
{
    int32_t i32i =0;
	volatile int32_t i32delay=1000;
	
    /*-----------------------------------------------------------------------------------------------------*/
    /* Initial time data struct and some parameters.                                                       */
    /*-----------------------------------------------------------------------------------------------------*/

	/* un-lock */
	/* Enable 32K Clock */
	CLK->PWRCTL |= CLK_PWRCTL_LXT_EN;
	  
