xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_rtc.c
	/* Waiting for 32K stable */
  	while(i32delay--);
	
	/* Enable RTC Clock */
	CLK->APBCLK |= CLK_APBCLK_RTC_EN;
	
    /*-----------------------------------------------------------------------------------------------------*/
    /* When RTC is power on, write 0xa5eb1357 to RTC_INIR to reset all logic.                              */
    /*-----------------------------------------------------------------------------------------------------*/
	
	RTC->INIR = DRVRTC_INIT_KEY;

    for (i32i = 0 ; i32i < DRVRTC_WAIT_COUNT ; i32i++)
    {
		if(RTC->INIR == 0x1)  /* Check RTC_INIR[0] to find out RTC reset signal */
        { 
            break;
        }
    }

    if (i32i == DRVRTC_WAIT_COUNT)
    {
        RTCDEBUG("\nRTC: DrvRTC_Init, initial RTC FAILED!\n");
        return E_DRVRTC_ERR_EIO;
    }

    return E_SUCCESS;
}

/**
 *  @brief Set Current time (Year/Month/Day, Hour/Minute/Sec and day of week)
 *
 *  @param[in]     sPt \n
 *                     Specify the time property and current time. It includes: \n                   
 *                     u8cClockDisplay: DRVRTC_CLOCK_12 / DRVRTC_CLOCK_24       \n
 *                     u8cAmPm: DRVRTC_AM / DRVRTC_PM                           \n
 *                     u32cSecond: Second value                                 \n
 *                     u32cMinute: Minute value                                 \n
 *                     u32cHour: Hour value                                     \n
 *                     u32cDayOfWeek: Day of week                               \n
 *                     u32cDay: Day value                                       \n
 *                     u32cMonth: Month value                                   \n
 *                     u32Year: Year value                                      \n
 *                     u8IsEnableWakeUp: Enable or not Wakeup function when time alarm happen 
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return                          
 *           E_SUCCESS: Success
 *           E_DRVRTC_ERR_EIO: Initial RTC Failed
 *
 *  @par Example
 *  @code   
 *  //Start RTC count from 2012.July.1, 13:20:00
 *  S_DRVRTC_TIME_DATA_T sInitTime;
 *  sInitTime.u32Year         = 2012;
 *  sInitTime.u32cMonth       = 7;	 
 *  sInitTime.u32cDay		  = 1;
 *  sInitTime.u32cHour        = 13;
 *  sInitTime.u32cMinute	  = 20;
 *  sInitTime.u32cSecond	  = 0;
 *  sInitTime.u32cDayOfWeek   = DRVRTC_MONDAY;
 *  sInitTime.u8cClockDisplay = DRVRTC_CLOCK_24;
 *  if(RTC_Open(&sInitTime) !=E_SUCCESS){
 *     printf("RTC Open Fail!!\n");}
 *  @endcode
 *
 */
int32_t RTC_Open (S_DRVRTC_TIME_DATA_T *sPt)
{
    uint32_t u32Reg;
	
	volatile int32_t i32delay=1000;
        
    /*-----------------------------------------------------------------------------------------------------*/
    /* DO BASIC JUDGEMENT TO Check RTC time data value is reasonable or not.                               */
    /*-----------------------------------------------------------------------------------------------------*/
	assert_param(	!( ((sPt->u32Year - DRVRTC_YEAR2000) > 99)|
							((sPt->u32cMonth == 0) || (sPt->u32cMonth > 12))|
							((sPt->u32cDay   == 0) || (sPt->u32cDay   > 31))));

	assert_param( (sPt->u8cClockDisplay==DRVRTC_CLOCK_12) || (sPt->u8cClockDisplay==DRVRTC_CLOCK_24));

	assert_param(	!( (sPt->u8cClockDisplay==DRVRTC_CLOCK_12) &&
							((sPt->u32cHour == 0) || (sPt->u32cHour > 12))));

	assert_param(	!( (sPt->u8cClockDisplay==DRVRTC_CLOCK_24) &&
							(sPt->u32cHour > 23)));

	assert_param(	!((sPt->u32cMinute > 59) |
							(sPt->u32cSecond > 59) |
							(sPt->u32cSecond > 59)));

	assert_param( !(sPt->u32cDayOfWeek > 6) );


    /*-----------------------------------------------------------------------------------------------------*/
    /* Important, call DrvRTC_WriteEnable() before write data into any register.                              */
    /* User should be write data as soon as possible.Access enable wiil clear after 200ms                  */
	/*-----------------------------------------------------------------------------------------------------*/
    g_u32Reg = RTC_WriteEnable();
    if (g_u32Reg != 0)
    {
        return E_DRVRTC_ERR_FAILED;
    }
    
    /*-----------------------------------------------------------------------------------------------------*/
    /* Second, set RTC 24/12 hour setting                                                                  */
    /*-----------------------------------------------------------------------------------------------------*/
    if (sPt->u8cClockDisplay == DRVRTC_CLOCK_12)
    {
        RTC_WriteEnable();
		RTC->TSSR &= ~RTC_TSSR_24hr;

        /*-------------------------------------------------------------------------------------------------*/
        /* important, range of 12-hour PM mode is 21 upto 32                                               */
        /*-------------------------------------------------------------------------------------------------*/
        if (sPt->u8cAmPm == DRVRTC_PM)
            sPt->u32cHour += 20;
    }
    else                                                                               /* DRVRTC_CLOCK_24 */
    {
        RTC_WriteEnable();
		RTC->TSSR |= RTC_TSSR_24hr;
        RTCDEBUG ("RTC: 24-hour\n");
    }

    /*-----------------------------------------------------------------------------------------------------*/
    /* Set RTC Calender Loading                                                                            */
    /*-----------------------------------------------------------------------------------------------------*/
    u32Reg    = ((sPt->u32Year - DRVRTC_YEAR2000) / 10) << 20;
    u32Reg    |= (((sPt->u32Year - DRVRTC_YEAR2000) % 10) << 16);
    u32Reg    |= ((sPt->u32cMonth  / 10) << 12);
    u32Reg    |= ((sPt->u32cMonth  % 10) << 8);
    u32Reg    |= ((sPt->u32cDay    / 10) << 4);
    u32Reg    |= (sPt->u32cDay     % 10);
    g_u32Reg = u32Reg;
	
	RTC_WriteEnable();
	RTC->TSSR |= RTC_TSSR_24hr;
    RTC->CLR = (uint32_t)g_u32Reg;

