xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_rtc.c
	/*-----------------------------------------------------------------------------------------------------*/
    /* Set RTC Time Loading                                                                                */
    /*-----------------------------------------------------------------------------------------------------*/
    u32Reg     = ((sPt->u32cHour / 10) << 20);
    u32Reg    |= ((sPt->u32cHour % 10) << 16);
    u32Reg    |= ((sPt->u32cMinute / 10) << 12);
    u32Reg    |= ((sPt->u32cMinute % 10) << 8);
    u32Reg    |= ((sPt->u32cSecond / 10) << 4);
    u32Reg    |= (sPt->u32cSecond % 10);
    g_u32Reg = u32Reg;

 	RTC_WriteEnable();
    RTC->TLR = (uint32_t)g_u32Reg;

	RTC->DWR = sPt->u32cDayOfWeek;

	RTC->TTR &= ~RTC_TTR_TWKE;
	RTC->TTR |= sPt->u8IsEnableWakeUp ? RTC_TTR_TWKE:0;

	/* Waiting for RTC settings stable */
  	while(i32delay--);

    return E_SUCCESS;
}

/**
 *  @brief Read current date/time from RTC setting
 *
 *  @param[in]     sPt \n
 *                     Specify the time property and current time. It includes: \n                   
 *                     u8cClockDisplay: DRVRTC_CLOCK_12 / DRVRTC_CLOCK_24       \n
 *                     u8cAmPm: DRVRTC_AM / DRVRTC_PM                           \n
 *                     u32cSecond: Second value                                 \n
 *                     u32cMinute: Minute value                                 \n
 *                     u32cHour: Hour value                                     \n
 *                     u32cDayOfWeek: Day of week                               \n
 *                     u32cDay: Day value                                       \n
 *                     u32cMonth: Month value                                   \n
 *                     u32Year: Year value                                      
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return                          
 *           E_SUCCESS: Success
 *           E_DRVRTC_ERR_ENOTTY: Parameter is wrong
 *
 *  @par Example
 *  @code   
 *  //Condition: You want to get current RTC calendar and time 
 *  S_DRVRTC_TIME_DATA_T sCurTime;
 *  RTC_Read(&sCurTime);
 *  printf("Current Time:%d/%02d/%02d	%02d:%02d:%02d\n",
 *  sCurTime.u32Year,sCurTime.u32cMonth,sCurTime.u32cDay,sCurTime.u32cHour,sCurTime.u32cMinute,sCurTime.u32cSecond);
 *  @endcode
 *
 */
int32_t RTC_Read (S_DRVRTC_TIME_DATA_T *sPt)
{
    uint32_t u32Tmp;
    
	sPt->u8cClockDisplay = RTC->TSSR & RTC_TSSR_24hr;    /* 12/24-hour */
    sPt->u32cDayOfWeek   = RTC->DWR & RTC_DWR_DWR;       /* Day of week */

	g_u32hiYear  = (RTC->CLR & RTC_CLR_TEN_YEAR) >> 20;
    g_u32loYear  = (RTC->CLR & RTC_CLR_YEAR) >> 16;
    g_u32hiMonth = (RTC->CLR & RTC_CLR_TEN_MON) >> 12;
    g_u32loMonth = (RTC->CLR & RTC_CLR_MON) >> 8;
    g_u32hiDay   = (RTC->CLR & RTC_CLR_TEN_DAY) >> 4;
    g_u32loDay   = (RTC->CLR & RTC_CLR_DAY);

	g_u32hiHour =  (RTC->TLR & RTC_TLR_TEN_HR) >> 20;
    g_u32loHour =  (RTC->TLR & RTC_TLR_HR) >> 16;
    g_u32hiMin  =  (RTC->TLR & RTC_TLR_TEN_MIN) >> 12;
    g_u32loMin  =  (RTC->TLR & RTC_TLR_MIN) >> 8;
    g_u32hiSec  =  (RTC->TLR & RTC_TLR_TEN_SEC) >> 4;
    g_u32loSec  =  (RTC->TLR & RTC_TLR_SEC);	

    u32Tmp = (g_u32hiYear * 10);									/* Compute to 20XX year */
    u32Tmp+= g_u32loYear;
    sPt->u32Year   =   u32Tmp  + DRVRTC_YEAR2000;
    
    u32Tmp = (g_u32hiMonth * 10);									/* Compute 0~12 month */
    sPt->u32cMonth = u32Tmp + g_u32loMonth;
    
    u32Tmp = (g_u32hiDay * 10);										/* Compute 0~31 day */
    sPt->u32cDay   =  u32Tmp  + g_u32loDay;

    if (sPt->u8cClockDisplay == DRVRTC_CLOCK_12)					/* Compute12/24 hout */
    {
        u32Tmp = (g_u32hiHour * 10);
        u32Tmp+= g_u32loHour;
        sPt->u32cHour = u32Tmp;                                		/* AM: 1~12. PM: 21~32. */

        if (sPt->u32cHour >= 21)
        {
            sPt->u8cAmPm = DRVRTC_PM;
            sPt->u32cHour -= 20;
        }
        else
        {
            sPt->u8cAmPm = DRVRTC_AM;
        }
        
        u32Tmp = (g_u32hiMin  * 10);
        u32Tmp+= g_u32loMin;
        sPt->u32cMinute = u32Tmp;
        
        u32Tmp = (g_u32hiSec  * 10);
        u32Tmp+= g_u32loSec;
        sPt->u32cSecond = u32Tmp;

    }
    else
    {   															/* DRVRTC_CLOCK_24 */
        u32Tmp = (g_u32hiHour * 10);
        u32Tmp+= g_u32loHour;
        sPt->u32cHour   = u32Tmp;
        
        u32Tmp = (g_u32hiMin  * 10);
        u32Tmp+= g_u32loMin;
        sPt->u32cMinute = u32Tmp;
        
        u32Tmp = (g_u32hiSec  * 10);
        u32Tmp+= g_u32loSec;
        sPt->u32cSecond = u32Tmp;
    }

    return E_SUCCESS;

}

/**
 *  @brief Read alarm date/time from RTC setting
 *
 *  @param[in]     sPt \n
 *                     Specify the time property and current time. It includes: \n                   
 *                     u8cClockDisplay: DRVRTC_CLOCK_12 / DRVRTC_CLOCK_24       \n
 *                     u8cAmPm: DRVRTC_AM / DRVRTC_PM                           \n
 *                     u32cSecond: Second value                                 \n
 *                     u32cMinute: Minute value                                 \n
 *                     u32cHour: Hour value                                     \n
 *                     u32cDayOfWeek: Day of week                               \n
 *                     u32cDay: Day value                                       \n
 *                     u32cMonth: Month value                                   \n
 *                     u32Year: Year value                                      
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return                          
 *           E_SUCCESS: Success
 *           E_DRVRTC_ERR_ENOTTY: Parameter is wrong
 *
 *  @par Example
 *  @code   
 *  //Condition: You want to get alarm RTC calendar and time 
 *  S_DRVRTC_TIME_DATA_T sCurTime;
 *  RTC_ReadAlarm(&sCurTime);
 *  printf("Current Time:%d/%02d/%02d	%02d:%02d:%02d\n",
 *  sCurTime.u32Year,sCurTime.u32cMonth,sCurTime.u32cDay,sCurTime.u32cHour,sCurTime.u32cMinute,sCurTime.u32cSecond);
 *  @endcode
 *
 */
int32_t RTC_ReadAlarm (S_DRVRTC_TIME_DATA_T *sPt)
{
    uint32_t u32Tmp;
    
