xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_rtc.c
	sPt->u8cClockDisplay = RTC->TSSR & RTC_TSSR_24hr;    /* 12/24-hour */
    sPt->u32cDayOfWeek   = RTC->DWR & RTC_DWR_DWR;       /* Day of week */

	g_u32hiYear  = (RTC->CAR & RTC_CAR_TEN_YEAR) >> 20;
	g_u32loYear  = (RTC->CAR & RTC_CAR_YEAR) >> 16;
	g_u32hiMonth = (RTC->CAR & RTC_CAR_TEN_MON) >> 12;
	g_u32loMonth = (RTC->CAR & RTC_CAR_MON) >> 8;
	g_u32hiDay	 = (RTC->CAR & RTC_CAR_TEN_DAY) >> 4;
	g_u32loDay	 = (RTC->CAR & RTC_CAR_DAY);
	
	g_u32hiHour =  (RTC->TAR & RTC_TAR_TEN_HR) >> 20;
	g_u32loHour =  (RTC->TAR & RTC_TAR_HR) >> 16;
	g_u32hiMin	=  (RTC->TAR & RTC_TAR_TEN_MIN) >> 12;
	g_u32loMin	=  (RTC->TAR & RTC_TAR_MIN) >> 8;
	g_u32hiSec	=  (RTC->TAR & RTC_TAR_TEN_SEC) >> 4;
	g_u32loSec	=  (RTC->TAR & RTC_TAR_SEC);

    u32Tmp = (g_u32hiYear * 10);									/* Compute to 20XX year */
    u32Tmp+= g_u32loYear;
    sPt->u32Year   =   u32Tmp  + DRVRTC_YEAR2000;
    
    u32Tmp = (g_u32hiMonth * 10);									/* Compute 0~12 month */
    sPt->u32cMonth = u32Tmp + g_u32loMonth;
    
    u32Tmp = (g_u32hiDay * 10);										/* Compute 0~31 day */
    sPt->u32cDay   =  u32Tmp  + g_u32loDay;

    if (sPt->u8cClockDisplay == DRVRTC_CLOCK_12)					/* Compute12/24 hout */
    {
        u32Tmp = (g_u32hiHour * 10);
        u32Tmp+= g_u32loHour;
        sPt->u32cHour = u32Tmp;                                		/* AM: 1~12. PM: 21~32. */

        if (sPt->u32cHour >= 21)
        {
            sPt->u8cAmPm = DRVRTC_PM;
            sPt->u32cHour -= 20;
        }
        else
        {
            sPt->u8cAmPm = DRVRTC_AM;
        }
        
        u32Tmp = (g_u32hiMin  * 10);
        u32Tmp+= g_u32loMin;
        sPt->u32cMinute = u32Tmp;
        
        u32Tmp = (g_u32hiSec  * 10);
        u32Tmp+= g_u32loSec;
        sPt->u32cSecond = u32Tmp;

    }
    else
    {   															/* DRVRTC_CLOCK_24 */
        u32Tmp = (g_u32hiHour * 10);
        u32Tmp+= g_u32loHour;
        sPt->u32cHour   = u32Tmp;
        
        u32Tmp = (g_u32hiMin  * 10);
        u32Tmp+= g_u32loMin;
        sPt->u32cMinute = u32Tmp;
        
        u32Tmp = (g_u32hiSec  * 10);
        u32Tmp+= g_u32loSec;
        sPt->u32cSecond = u32Tmp;
    }

    return E_SUCCESS;

}



/**
 *  @brief Update current date/time to RTC
 *
 *  @param[in]     sPt \n
 *                     Specify the time property and current time. It includes: \n                   
 *                     u8cClockDisplay: DRVRTC_CLOCK_12 / DRVRTC_CLOCK_24       \n
 *                     u8cAmPm: DRVRTC_AM / DRVRTC_PM                           \n
 *                     u32cSecond: Second value                                 \n
 *                     u32cMinute: Minute value                                 \n
 *                     u32cHour: Hour value                                     \n
 *                     u32cDayOfWeek: Day of week                               \n
 *                     u32cDay: Day value                                       \n
 *                     u32cMonth: Month value                                   \n
 *                     u32Year: Year value                                      
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return                          
 *            E_SUCCESS: Success
 *            E_DRVRTC_ERR_ENOTTY: Parameter is wrong.
 *            E_DRVRTC_ERR_FAILED: Initial RTC failed
 *
 *  @par Example
 *  @code   
 *  //Condition: Update current the second of time to zero 
 *  S_DRVRTC_TIME_DATA_T sCurTime;
 *  RTC_Read(&sCurTime);
 *  sCurTime.u32cSecond = 0;
 *  RTC_Write(&sCurTime);
 *  @endcode
 *
 */
int32_t RTC_Write(S_DRVRTC_TIME_DATA_T *sPt)
{
    uint32_t u32Reg;
    /*-----------------------------------------------------------------------------------------------------*/
    /* Check RTC time data value is reasonable or not.                                                     */
    /*-----------------------------------------------------------------------------------------------------*/
	assert_param(	!( ((sPt->u32Year - DRVRTC_YEAR2000) > 99)|
							((sPt->u32cMonth == 0) || (sPt->u32cMonth > 12))|
							((sPt->u32cDay   == 0) || (sPt->u32cDay   > 31))));

	assert_param( !( (sPt->u32cMonth == 0) || (sPt->u32cMonth > 12) ));
    
	assert_param( !( (sPt->u32cDay == 0) || (sPt->u32cDay > 31) ));

	assert_param( (sPt->u8cClockDisplay==DRVRTC_CLOCK_12) || (sPt->u8cClockDisplay==DRVRTC_CLOCK_24));

	assert_param(	!( (sPt->u8cClockDisplay==DRVRTC_CLOCK_12) &&
							((sPt->u32cHour == 0) || (sPt->u32cHour > 12))));

	assert_param(	!( (sPt->u8cClockDisplay==DRVRTC_CLOCK_24) &&
							(sPt->u32cHour > 23)));

	assert_param( !(sPt->u32cMinute > 59));
	assert_param( !(sPt->u32cSecond > 59));
	assert_param( !(sPt->u32cDayOfWeek > 6));


    /*-----------------------------------------------------------------------------------------------------*/
    /* Important, call DrvRTC_Open() before write data into any register.                                     */
    /*-----------------------------------------------------------------------------------------------------*/
    g_u32Reg = RTC_WriteEnable();
    if (g_u32Reg != 0)
    {
        return E_DRVRTC_ERR_FAILED;
    }

	/*---------------------------------------------------------------------------------------------*/
    /* Second, set RTC time data.                                                                  */
    /*---------------------------------------------------------------------------------------------*/

    if (sPt->u8cClockDisplay == DRVRTC_CLOCK_12)
    {
    	g_chHourMode = DRVRTC_CLOCK_12;
		RTC->TSSR &= ~RTC_TSSR_24hr;
        RTCDEBUG ("RTC: 12-hour\n");
        /*-----------------------------------------------------------------------------------------*/
        /* important, range of 12-hour PM mode is 21 upto 32                                       */
        /*-----------------------------------------------------------------------------------------*/
        if (sPt->u8cAmPm == DRVRTC_PM)
        	sPt->u32cHour += 20;
    }
    else                                                                  /* DRVRTC_CLOCK_24 */
    {
    	g_chHourMode = DRVRTC_CLOCK_24;
		RTC->TSSR |= RTC_TSSR_24hr;
        RTCDEBUG ("RTC: 24-hour\n");
    }

