xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_rtc.c
	RTC->DWR = sPt->u32cDayOfWeek & RTC_DWR_DWR;
		    
	/*---------------------------------------------------------------------------------------------*/
    /* Second, set RTC time data.                                                                  */
    /*---------------------------------------------------------------------------------------------*/

	u32Reg     = ((sPt->u32Year - DRVRTC_YEAR2000) / 10) << 20;
	u32Reg    |= (((sPt->u32Year - DRVRTC_YEAR2000) % 10) << 16);
	u32Reg    |= ((sPt->u32cMonth  / 10) << 12);
	u32Reg    |= ((sPt->u32cMonth  % 10) << 8);
	u32Reg    |= ((sPt->u32cDay    / 10) << 4);
	u32Reg    |= (sPt->u32cDay     % 10);
    g_u32Reg = u32Reg;
	RTC_WriteEnable();
          
	RTC->CLR = (uint32_t)g_u32Reg;
	RTCDEBUG ("RTC: REG_RTC_CLR[0x%08x]\n", RTC->CLR);  
            
	u32Reg     = ((sPt->u32cHour / 10) << 20);
	u32Reg    |= ((sPt->u32cHour % 10) << 16);
	u32Reg    |= ((sPt->u32cMinute / 10) << 12);
	u32Reg    |= ((sPt->u32cMinute % 10) << 8);
	u32Reg    |= ((sPt->u32cSecond / 10) << 4);
	u32Reg    |= (sPt->u32cSecond % 10);
	g_u32Reg = u32Reg;
		
	RTC_WriteEnable();
    RTC->TLR = (uint32_t)g_u32Reg;
	RTCDEBUG ("RTC: REG_RTC_TLR[0x%08x]\n", RTC->TLR);   
		
    return E_SUCCESS;	

}


/**
 *  @brief Update alarm date/time to RTC
 *
 *  @param[in]     sPt \n
 *                     Specify the time property and current time. It includes: \n                   
 *                     u8cClockDisplay: DRVRTC_CLOCK_12 / DRVRTC_CLOCK_24       \n
 *                     u8cAmPm: DRVRTC_AM / DRVRTC_PM                           \n
 *                     u32cSecond: Second value                                 \n
 *                     u32cMinute: Minute value                                 \n
 *                     u32cHour: Hour value                                     \n
 *                     u32cDayOfWeek: Day of week                               \n
 *                     u32cDay: Day value                                       \n
 *                     u32cMonth: Month value                                   \n
 *                     u32Year: Year value                                      
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return                          
 *            E_SUCCESS: Success
 *            E_DRVRTC_ERR_ENOTTY: Parameter is wrong.
 *            E_DRVRTC_ERR_FAILED: Initial RTC failed
 *
 *  @par Example
 *  @code   
 *  //Condition: Update current the second of time to zero 
 *  S_DRVRTC_TIME_DATA_T sCurTime;
 *  RTC_ReadAlarm(&sCurTime);
 *  sCurTime.u32cSecond = 0;
 *  RTC_WriteAlarm(&sCurTime);
 *  @endcode
 *
 */
int32_t RTC_WriteAlarm(S_DRVRTC_TIME_DATA_T *sPt)
//int32_t RTC_Write(E_DRVRTC_TIME_SELECT eTime, S_DRVRTC_TIME_DATA_T *sPt)
{
    __IO uint32_t u32Reg;
    /*-----------------------------------------------------------------------------------------------------*/
    /* Check RTC time data value is reasonable or not.                                                     */
    /*-----------------------------------------------------------------------------------------------------*/
	assert_param(	!( ((sPt->u32Year - DRVRTC_YEAR2000) > 99)|
							((sPt->u32cMonth == 0) || (sPt->u32cMonth > 12))|
							((sPt->u32cDay   == 0) || (sPt->u32cDay   > 31))));

	assert_param( !( (sPt->u32cMonth == 0) || (sPt->u32cMonth > 12) ));
    
	assert_param( !( (sPt->u32cDay == 0) || (sPt->u32cDay > 31) ));

	assert_param( (sPt->u8cClockDisplay==DRVRTC_CLOCK_12) || (sPt->u8cClockDisplay==DRVRTC_CLOCK_24));

	assert_param(	!( (sPt->u8cClockDisplay==DRVRTC_CLOCK_12) &&
							((sPt->u32cHour == 0) || (sPt->u32cHour > 12))));

	assert_param(	!( (sPt->u8cClockDisplay==DRVRTC_CLOCK_24) &&
							(sPt->u32cHour > 23)));

	assert_param( !(sPt->u32cMinute > 59));
	assert_param( !(sPt->u32cSecond > 59));
	assert_param( !(sPt->u32cDayOfWeek > 6));


    /*-----------------------------------------------------------------------------------------------------*/
    /* Important, call DrvRTC_Open() before write data into any register.                                     */
    /*-----------------------------------------------------------------------------------------------------*/
    g_u32Reg = RTC_WriteEnable();
    if (g_u32Reg != 0)
    {
        return E_DRVRTC_ERR_FAILED;
    }

	/*---------------------------------------------------------------------------------------------*/
    /* Set Calender alarm time data.                                                               */
    /*---------------------------------------------------------------------------------------------*/
	u32Reg     = ((sPt->u32Year - DRVRTC_YEAR2000) / 10) << 20;
	u32Reg    |= (((sPt->u32Year - DRVRTC_YEAR2000) % 10) << 16);
	u32Reg    |= ((sPt->u32cMonth  / 10) << 12);
	u32Reg    |= ((sPt->u32cMonth  % 10) << 8);
	u32Reg    |= ((sPt->u32cDay    / 10) << 4);
	u32Reg    |= (sPt->u32cDay     % 10);
    g_u32Reg = u32Reg;
	RTC_WriteEnable();
			
	RTC->CAR = (uint32_t)g_u32Reg;
	RTCDEBUG ("RTC: REG_RTC_CAR[0x%08x]\n", RTC->CAR);  
			
						 
    if (g_chHourMode == DRVRTC_CLOCK_12)
    {
    	if (sPt->u8cAmPm == DRVRTC_PM)       /* important, range of 12-hour PM mode is 21 upto 32 */
        	sPt->u32cHour += 20;
    }

	/*---------------------------------------------------------------------------------------------*/
    /* Set Time alarm time data.                                                                   */
    /*---------------------------------------------------------------------------------------------*/
	u32Reg     = ((sPt->u32cHour / 10) << 20);
	u32Reg    |= ((sPt->u32cHour % 10) << 16);
	u32Reg    |= ((sPt->u32cMinute / 10) << 12);
	u32Reg    |= ((sPt->u32cMinute % 10) << 8);
	u32Reg    |= ((sPt->u32cSecond / 10) << 4);
	u32Reg    |= (sPt->u32cSecond % 10);

	g_u32Reg = u32Reg;
    RTC_WriteEnable();
    RTC->TAR = (uint32_t)g_u32Reg;
	RTCDEBUG ("RTC: REG_RTC_TAR[0x%08x]\n", RTC->TAR);   

	/*---------------------------------------------------------------------------------------------*/
    /* Finally, enable alarm interrupt.                                                            */
    /*---------------------------------------------------------------------------------------------*/
	RTC_EnableInt(RTC_RIER_AIER);
            
	RTC->TTR &= ~RTC_TTR_TWKE;
	RTC->TTR |= sPt->u8IsEnableWakeUp ? RTC_TTR_TWKE:0;
				
	return E_SUCCESS;

