xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_rtc.c
}



/**
 *  @brief Read/Write the spare registers
 *
 *  @param[in]     sparenum   Specify the number of register (0~19)
 *  @param[in]     value      The value we want to write
 *  @param[in]     wrsel      Specify the writing/reading access  [1:Write; 0:Read]                                     
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return                               
 *           E_SUCCESS: Success to write  \n
 *           Or the content value of specified spare register in reading
 *
 *  @par Example
 *  @code   
 *  RTC_SpareRegsAccess(10, 0x5555, 1);
 *  @endcode
 *
 */
int32_t RTC_SpareRegsAccess (int32_t sparenum, int32_t value, int32_t wrsel)
{
	uint32_t ret = E_SUCCESS;

	RTC_WriteEnable();

	if(wrsel==0)
		while((RTC->SPRCTL & RTC_SPRCTL_SPRRDY) == 0);
	
	if(sparenum==0)
		(wrsel==1) ? (RTC->SPR0=value) : (ret=RTC->SPR0);
	if(sparenum==1)
		(wrsel==1) ? (RTC->SPR1=value) : (ret=RTC->SPR1);
	if(sparenum==2)
		(wrsel==1) ? (RTC->SPR2=value) : (ret=RTC->SPR2);
	if(sparenum==3)
		(wrsel==1) ? (RTC->SPR3=value) : (ret=RTC->SPR3);
	if(sparenum==4)
		(wrsel==1) ? (RTC->SPR4=value) : (ret=RTC->SPR4);
	if(sparenum==5)
		(wrsel==1) ? (RTC->SPR5=value) : (ret=RTC->SPR5);
	if(sparenum==6)
		(wrsel==1) ? (RTC->SPR6=value) : (ret=RTC->SPR6);
	if(sparenum==7)
		(wrsel==1) ? (RTC->SPR7=value) : (ret=RTC->SPR7);
	if(sparenum==8)
		(wrsel==1) ? (RTC->SPR8=value) : (ret=RTC->SPR8);
	if(sparenum==9)
		(wrsel==1) ? (RTC->SPR9=value) : (ret=RTC->SPR9);
	if(sparenum==10)
		(wrsel==1) ? (RTC->SPR10=value) : (ret=RTC->SPR10);
	if(sparenum==11)
		(wrsel==1) ? (RTC->SPR11=value) : (ret=RTC->SPR11);
	if(sparenum==12)
		(wrsel==1) ? (RTC->SPR12=value) : (ret=RTC->SPR12);
	if(sparenum==13)
		(wrsel==1) ? (RTC->SPR13=value) : (ret=RTC->SPR13);
	if(sparenum==14)
		(wrsel==1) ? (RTC->SPR14=value) : (ret=RTC->SPR14);
	if(sparenum==15)
		(wrsel==1) ? (RTC->SPR15=value) : (ret=RTC->SPR15);
	if(sparenum==16)
		(wrsel==1) ? (RTC->SPR16=value) : (ret=RTC->SPR16);
	if(sparenum==17)
		(wrsel==1) ? (RTC->SPR17=value) : (ret=RTC->SPR17);
	if(sparenum==18)
		(wrsel==1) ? (RTC->SPR18=value) : (ret=RTC->SPR18);
	if(sparenum==19)
		(wrsel==1) ? (RTC->SPR19=value) : (ret=RTC->SPR19);

	if(wrsel==1)
		while((RTC->SPRCTL & RTC_SPRCTL_SPRRDY) == 0);
	
	return ret;

}

/**
 *  @brief Enable Spare function and set the detection edge
 *
 *  @param[in]     eSpareEdge    Detection edge (DRVRTC_SNOOPER_RISING, RVRTC_SNOOPER_FALLING)                                    
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return  None                             
 *
 *  @par Example
 *  @code   
 *  RTC_EnableSpareFunc(DRVRTC_SNOOPER_RISING);
 *  @endcode
 *
 */
void RTC_EnableSpareFunc(uint32_t eSpareEdge)
{
	RTC_WriteEnable();

	/* detection edge select */
	if(eSpareEdge)
	{
		RTC->SPRCTL |= RTC_SPRCTL_SNOOPEDGE;
	}
	else
	{
		RTC->SPRCTL &= ~RTC_SPRCTL_SNOOPEDGE;
	}

	while((RTC->SPRCTL & RTC_SPRCTL_SPRRDY) == 0);
	
	/* enable snooper pin event detection */
	RTC->SPRCTL |= RTC_SPRCTL_SNOOPEN;
	while((RTC->SPRCTL & RTC_SPRCTL_SPRRDY) == 0);
	
}

/**
 *  @brief Disable Spare function
 *
 *  @param   None                                    
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return  None                             
 *
 *  @par Example
 *  @code   
 *  RTC_DisableSpareFunc();
 *  @endcode
 *
 */
void RTC_DisableSpareFunc(void)
{
	RTC_WriteEnable();

	/* Disable snooper pin event detection */
	RTC->SPRCTL &= ~RTC_SPRCTL_SNOOPEN;
	while((RTC->SPRCTL & RTC_SPRCTL_SPRRDY) == 0);
}



/**
 *  @brief The function is used to set time tick period for periodic time tick Interrupt.
 *
 *  @param[in]   ucMode 
 *                       The structure of DRVRTC_TICK.
 *                       It is ued to set the RTC time tick period for Periodic Time Tick Interrupt request. 
 *                       It consists of: \n 
 *                       DRVRTC_TICK_1_SEC: Time tick is 1 second        \n
 *                       DRVRTC_TICK_1_2_SEC: Time tick is 1/2 second    \n
 *                       DRVRTC_TICK_1_4_SEC: Time tick is 1/4 second    \n
 *                       DRVRTC_TICK_1_8_SEC: Time tick is 1/8 second    \n
 *                       DRVRTC_TICK_1_16_SEC: Time tick is 1/16 second  \n
 *                       DRVRTC_TICK_1_32_SEC: Time tick is 1/32 second  \n
 *                       DRVRTC_TICK_1_64_SEC: Time tick is 1/64 second  \n
 *                       DRVRTC_TICK_1_128_SEC: Time tick is 1/128 econd 
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return  
 *           E_SUCCESS: Success
 *           E_DRVRTC_ERR_EIO: Initial RTC Failed.
 *           E_DRVRTC_ERR_ENOTTY: Parameter is wrong
 *
 *  @par Example
 *  @code   
 *  //Set Tick interrupt is 128 tick/sec
 *  RTC_SetTickMode (DRVRTC_TICK_1_128_SEC) ;
 *  @endcode
 *
 */
int32_t RTC_SetTickMode(uint8_t ucMode)
{

    if (RTC_WriteEnable() != 0)   				/* Write PASSWORD to access enable*/
    {
    	return E_DRVRTC_ERR_EIO ;
    }
    
	if (ucMode > DRVRTC_TICK_1_128_SEC)             /* Tick mode 0 to 7 */
    {
    	return E_DRVRTC_ERR_ENOTTY ;
    }
            
	RTC->TTR = RTC->TTR & ~RTC_TTR_TTR | ucMode;

	return E_SUCCESS;

}

/**
 *  @brief The function is used to enable specified interrupt.
 *
 *  @param[in]   str_IntSrc   The structure of interrupt source. It consists of: \n  
 *                            RTC_RIER_AIER: Alarm interrupt                  \n
 *                            RTC_RIER_TIER: Tick interrupt                    \n
 *                            RTC_RIER_SNOOPIER: Snooper interrupt              \n
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return  
 *           E_SUCCESS: Success
 *
 *  @par Example
 *  @code   
 *  //Enable tick interrupt and install callback function "RTC_TickCallBackfn".
 *  RTC_EnableInt(DRVRTC_TICK_INT,RTC_TickCallBackfn)
 *  @endcode
 *
 */
int32_t RTC_EnableInt(uint32_t str_IntSrc)
{
	RTC->RIER |= str_IntSrc; 
	
	NVIC_EnableIRQ(RTC_IRQn); 

	return E_SUCCESS;

