xhawk18/TinyThread/NANO100BSeriesBSP/Libraries/NANO1xx_Drivers/Source/nano1xx_rtc.c
}

/**
 *  @brief The function is used to disable specified interrupt.
 *
 *  @param[in]   i32IntSrc   The structure of interrupt source. It consists of: \n  
 *                            RTC_RIER_AIER: Alarm interrupt                  \n
 *                            RTC_RIER_TIER: Tick interrupt                    \n
 *                            RTC_RIER_SNOOPIER: Snooper interrupt              \n
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return  
 *           E_SUCCESS: Successg
 *
 *  @par Example
 *  @code   
 *  //Disable tick, snooper and alarm interrupt
 *  RTC_DisableInt(DRVRTC_ALL_INT);
 *  @endcode
 *
 */
int32_t RTC_DisableInt(uint32_t i32IntSrc)
{
	
	if(i32IntSrc & RTC_RIER_TIER)
	{	
		RTC->RIER &= ~RTC_RIER_TIER; 
		RTC->RIIR |= RTC_RIIR_TIS; 
	}
	
	if(i32IntSrc & RTC_RIER_AIER)
	{
		RTC->RIER &= ~RTC_RIER_AIER; 
		RTC->RIIR |= RTC_RIIR_AIS;
	}
	
	if(i32IntSrc & RTC_RIER_SNOOPIER)
	{
		RTC->RIER &= ~RTC_RIER_SNOOPIER; 
		RTC->RIIR |= RTC_RIIR_SNOOPIS; 
	}

	return E_SUCCESS;	

}

/**
 *  @brief Disable NVIC channel of RTC and both tick and alarm interrupt.
 *
 *  @param   None
 *
 *  @par Include:
 *       nano1xx_drivers/nano1xx_rtc.h
 *
 *  @return  E_SUCCESS: Success
 *
 *  @par Example
 *  @code   
 *  RTC_Close();
 *  @endcode
 *
 */
int32_t RTC_Close (void)
{
  	NVIC_DisableIRQ(RTC_IRQn);
  
  	RTC_DisableInt(RTC_RIER_TIER | RTC_RIER_AIER | RTC_RIER_SNOOPIER);
	
    return E_SUCCESS;
}


/*@}*/ /* end of group NANO1xx_RTC_EXPORTED_FUNCTIONS */

/*@}*/ /* end of group NANO1xx_RTC_Driver */

/*@}*/ /* end of group NANO1xx_Device_Driver */


/*** (C) COPYRIGHT 2012 Nuvoton Technology Corp. ***/



